# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "awscli"
brew "dnsmasq", restart_service: true
brew "fdupes"
brew "git-flow"
brew "git"
brew "jq"
brew "maven"
brew "newman"
brew "openssl@1.1"
brew "python@3.9"
brew "readline"
brew "swagger-codegen"
brew "tree"
brew "wget"
brew "yarn"
brew "zlib"

cask "coderunner"
cask "dash"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "microsoft-edge"
cask "ngrok"
cask "postman"
cask "slack"
cask "sourcetree"
cask "virtualbox"
cask "visual-studio-code"
